In [1]:
print("hello project")

hello project

In [2]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine

In [3]:
df= pd.read_csv(r'C:\Users\akhil\OneDrive\Desktop\Project_Walmart\Walmart.csv')

### dataframe inspection

In [4]:
df.head(2)

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48

In [5]:
print(pd.__version__)

2.3.2

### dataframe inspection

In [6]:
df.tail(5)

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
10046,9996,WALM056,Rowlett,Fashion accessories,$37,3.0,03/08/23,10:10:00,Cash,3.0,0.33
10047,9997,WALM030,Richardson,Home and lifestyle,$58,2.0,22/02/21,14:20:00,Cash,7.0,0.48
10048,9998,WALM050,Victoria,Fashion accessories,$52,3.0,15/06/23,16:00:00,Credit card,4.0,0.48
10049,9999,WALM032,Tyler,Home and lifestyle,$79,2.0,25/02/21,12:25:00,Cash,7.0,0.48
10050,10000,WALM069,Rockwall,Fashion accessories,$62,3.0,26/09/20,9:48:00,Cash,3.0,0.33

In [7]:
df.sample(3)

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
9256,9257,WALM054,Sherman,Home and lifestyle,$36,3.0,15/06/23,7:35:00,Cash,3.0,0.21
5481,5482,WALM067,Haltom City,Fashion accessories,$81,1.0,02/11/21,15:57:00,Credit card,3.0,0.33
5364,5365,WALM011,Lubbock,Home and lifestyle,$80,3.0,12/11/23,18:49:00,Credit card,6.0,0.48

In [8]:
df.index

RangeIndex(start=0, stop=10051, step=1)

In [9]:
df.shape

(10051, 11)

In [10]:
df.memory_usage()

Index               132
invoice_id        80408
Branch            80408
City              80408
category          80408
unit_price        80408
quantity          80408
date              80408
time              80408
payment_method    80408
rating            80408
profit_margin     80408
dtype: int64

In [11]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [12]:
df.describe()

         invoice_id      quantity        rating  profit_margin
count  10051.000000  10020.000000  10051.000000   10051.000000
mean    5025.741220      2.353493      5.825659       0.393791
std     2901.174372      1.602658      1.763991       0.090669
min        1.000000      1.000000      3.000000       0.180000
25%     2513.500000      1.000000      4.000000       0.330000
50%     5026.000000      2.000000      6.000000       0.330000
75%     7538.500000      3.000000      7.000000       0.480000
max    10000.000000     10.000000     10.000000       0.570000

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

### grouping and aggregating

In [14]:
df.duplicated().sum() #duplicate values sum

np.int64(51)

In [15]:
df.groupby('rating').mean(numeric_only=True)

         invoice_id  quantity  profit_margin
rating
3.0     7607.819028  2.042399       0.382399
4.0     5677.513481  2.009633       0.392642
4.1      497.294118  4.411765       0.374118
4.2      588.500000  6.818182       0.384545
4.3      588.277778  5.555556       0.401667
...             ...       ...            ...
9.6      425.705882  5.823529       0.400588
9.7      405.571429  4.642857       0.396429
9.8      585.368421  4.368421       0.401053
9.9      373.500000  5.875000       0.395625
10.0     305.200000  7.600000       0.420000

[62 rows x 3 columns]

In [16]:
df.nunique()

invoice_id        10000
Branch              100
City                 98
category              6
unit_price         1008
quantity             10
date               1460
time               1001
payment_method        3
rating               62
profit_margin         6
dtype: int64

In [17]:
df.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [18]:
df.drop_duplicates(inplace=True)

In [19]:
df.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [20]:
df.drop_duplicates(inplace=True)
df.duplicated().sum()

np.int64(0)

In [21]:
df.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [22]:
df.shape

(10000, 11)

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10000 non-null  int64
 1   Branch          10000 non-null  object
 2   City            10000 non-null  object
 3   category        10000 non-null  object
 4   unit_price      9969 non-null   object
 5   quantity        9969 non-null   float64
 6   date            10000 non-null  object
 7   time            10000 non-null  object
 8   payment_method  10000 non-null  object
 9   rating          10000 non-null  float64
 10  profit_margin   10000 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 937.5+ KB

In [24]:
df.columns

Index(['invoice_id', 'Branch', 'City', 'category', 'unit_price', 'quantity',
       'date', 'time', 'payment_method', 'rating', 'profit_margin'],
      dtype='object')

In [ ]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,total
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48,604.17

In [ ]:
df.shape

(10000, 12)

In [ ]:
df.to_csv('walmart_clean_data.csv', index=False)

In [ ]:
#mysql connection
engine=create_engine("mysql+pymysql://root:6524@localhost:3306/walmart_db")